print( 1 + 1 )
if 4 in [1,2,3,4]:print("4가 있습니다")
"""
    [1]파이썬이란? 
        - 인터프리터 언어 
        - 구글, 인스타그램 , 넷플릭스 , 아마존 등등 기업에서 사용 사용 되고 있다.
    파이썬 특징 
        - 파이썬은 인간다운 언어이다.
            - if 4 in [1,2,3,4]:print("4가 있습니다")
        - 문법이 쉬워 빠르게 배울 수 있다.
            - 풍부한 다양한 라이브러리 제공 
        - 무료 이지만 강력하다.
            - 오픈소스 
            - 시스템 , 하드웨어 같은 복잡한 프로그램 은 파이썬과 어울리지 않는다.
                - 다른 언어들과 융합이 가능하다.
        - 간결하다 
            - 다른 언어 : { } 중괄호 를 이용한 코드 맞춤 
                    if( a > 4 ){
                        System.out.print("a가 4보다 크다.")
                    }
            - PYTHON : { } 없이 들여쓰기[tab]를 이용한 코드 맞춤     
                    if a > 4 :
                        print("a가 4보다크다.")
    파이썬의 활용처 
        - 웹 프로그래밍
        - *인공지능 , 머신러닝 : 텐서플로
        - 수치 연산 : 넘파이
        - *데이터분석 : 넘파이 
        - 데이터베이스 : mysql 
        - 유틸리티 제작 
        - GUI(화면) 프로그래밍
        - *C/C++ 결합 
        - *사물인터넷 : 라즈베리파이
"""
